<template>
<div>
  <div>
    <v-divider></v-divider>
    <div @click="dialog=true">
      <Core-ListMenu head="ข้อกำหนดและเงื่อนไข" txt=" " icon="mdi-arrow-right"></Core-ListMenu>
    </div>
    <v-divider></v-divider>
    <div @click="dialog2=true">
      <Core-ListMenu head="นโยบายความเป็นส่วนตัว" txt=" " icon="mdi-arrow-right"></Core-ListMenu>
    </div>
    <v-divider></v-divider>
    <div @click="dialog5=true">
      <Core-ListMenu head="ติดต่อเรา" txt=" " icon="mdi-arrow-right"></Core-ListMenu>
    </div>
    <v-divider></v-divider>
    <Core-ListMenu head="เวอร์ชัน" txt="0.1a"></Core-ListMenu>
    <v-divider></v-divider>
    <div class="p-2">
      <v-btn depressed block color="error" large class="mt-6 " @click="logout()">ออกจากระบบ</v-btn>
    </div>
  </div>
  <v-dialog v-model="dialog" scrollable :overlay="false" max-width="500px" transition="dialog-transition">
    <v-card>
      <v-card-title primary-title>
        ข้อกำหนดและเงื่อนไข <v-spacer></v-spacer>
        <v-btn icon @click="dialog=false">
          <v-icon>mdi-close</v-icon>
        </v-btn>
      </v-card-title>
      <v-card-text>
        <div class="p-2">
          <p>ข้อกำหนดและเงื่อนไข
            บริการต่าง ๆ ที่ประเทศไทย แสดงผ่านเว็บไซต์ของเรา (“เว็บไซต์”) จะมีไว้สำหรับผู้หางาน หรือ ผู้ใช้งานอื่น อาทิเช่น ผู้ลงโฆษณา การเข้าสู่เนื้อหาที่ปรากฎในเว็บไซต์ดังกล่าวและการใช้เนื้อหารวมถึงบริการต่าง ๆ ที่แสดงผ่านเว็บไซต์ดังกล่าว อยู่ภายใต้บังคับแห่งข้อกำหนดและเงื่อนไขที่ระบุไว้ต่อจากนี้ (“ข้อกำหนดและเงื่อนไขของเว็บไซต์“) และ ภายใต้บังคับแห่งมาตรการการดูแลรักษาข้อมูลส่วนบุคคลของเรา (“มาตรการด้านข้อมูลส่วนบุคคล“) หากท่านต้องการรายละเอียดเพิ่มเติม เกี่ยวกับมาตรการด้านข้อมูลส่วนบุคคลของประเทศไทย ให้ท่านคลิกที่ ลิงก์นี้

            หากท่านไม่ยินยอมปฏิบัติตามข้อกำหนดและเงื่อนไขของเว็บไซต์ และ/หรือ ไม่ยินยอมปฏิบัติตามมาตรการด้านข้อมูลส่วนบุคคล โปรดกรุณาอย่าเข้าร่วม เกี่ยวข้อง เข้าสู่เนื้อหาของเว็บไซต์ ดู ดาวน์โหลด หรือใช้บริการใด ที่ประเทศไทย นำเสนอผ่านเว็บไซต์ของเรา การที่ท่านยังคงใช้เว็บไซต์ของเรา แสดงว่าท่านได้ยอมรับแล้วว่า ท่านรับทราบ อ่านและเข้าใจข้อกำหนดและเงื่อนไขของเว็บไซต์ และมาตรการด้านข้อมูลส่วนบุคคลของเรา และท่านตกลงผูกพันตนตามบทบัญญัติทั้งปวงทั้งในข้อกำหนดและเงื่อนไขของเว็บไซต์ และมาตรการด้านข้อมูลส่วนบุคคลดังกล่าวนั้น ประเทศไทยขอสงวนสิทธิ์ที่จะแก้ไข เพิ่มเติม ลบทิ้ง หรือ ปรับแก้มาตรการด้านข้อมูลส่วนบุคคล รวมถึงข้อกำหนดและเงื่อนไขต่าง ๆ ในเว็บไซต์เมื่อใดก็ได้ โดยไม่ต้องแจ้งให้ทราบล่วงหน้า ทั้งนี้ ขอแนะนำให้ท่านทบทวนข้อกำหนดและเงื่อนไขของเว็บไซต์ และ มาตรการด้านข้อมูลส่วนบุคคลเป็นระยะ อนึ่ง สิทธิของท่านในการเข้าสู่เว็บไซต์และการให้บริการของประเทศไทย จะสิ้นสุดลงเมื่อท่านได้แจ้งต่อ ประเทศไทย ถึงการบอกกล่าวของท่านต่อการเปลี่ยนแปลงใดที่ไม่เป็นที่ยอมรับ มิฉะนั้นการที่ท่านยังคงใช้งาน จะถือเป็นการตกลงยอมรับของท่านต่อการเปลี่ยนแปลงทั้งปวง และการเปลี่ยนแปลงทั้งปวงเหล่านั้นจะมีผลผูกพันต่อท่าน

            เว็บไซต์นี้ไม่ได้จัดทำขึ้นสำหรับเด็กอายุต่ำกว่า 10 ปี ดังนั้น บุคคลอายุต่ำกว่า 10 ปี ไม่อาจใช้หรือลงทะเบียนบนเว็บไซต์นี้ หรือให้ข้อมูลใด ๆ ซึ่งรวมถึงข้อมูลส่วนบุคคลแก่ประเทศไทย

            สำหรับเด็กที่มีอายุอย่างน้อย 10 ปี แต่ไม่ถึง 20 ปี หรือยังไม่บรรลุนิติภาวะโดยประการอื่นตามกฎหมายไทย ท่านต้องรับรองและรับประกันว่าบิดา/มารดาหรือผู้ปกครองตามกฎหมายของท่านได้รับแจ้งโดยชอบถึงข้อกำหนดและเงื่อนไขฉบับนี้และนโยบายความเป็นส่วนตัว และตกลงตามข้อกำหนดของเอกสารดังกล่าวแล้ว อีกทั้งท่านต้องรับรองและรับประกันว่า ในกรณีที่กฎหมายกำหนดให้ต้องได้รับความยินยอมสำหรับการใช้เว็บไซต์นี้ ท่านมีหน้าที่รับผิดชอบในการดำเนินการให้ได้มาซึ่งความยินยอมโดยชอบจากบิดา/มารดาหรือผู้ปกครองตามกฎหมายของท่าน (“ความยินยอมของบิดา/มารดา”) โดยท่านมีหน้าที่ต้องแสดงหลักฐานการให้ความยินยอมของบิดา/มารดาดังกล่าวแก่ประเทศไทย โดยทันทีเมื่อได้รับการร้องขอ ประเทศไทย ขอสงวนสิทธิในการระงับหรือยกเลิกบัญชีของท่านหากท่านไม่แสดงหลักฐานการให้ความยินยอมของบิดา/มารดาภายในระยะเวลาที่กำหนด ทั้งนี้ โดยจะบอกกล่าวหรือไม่บอกกล่าวก็ได้ และประเทศไทย ไม่ต้องรับผิดหรือรับผิดชอบใด ๆ สำหรับการระงับหรือยกเลิกบัญชีนั้น</p>

        </div>
      </v-card-text>
    </v-card>
  </v-dialog>
  <v-dialog v-model="dialog2" scrollable :overlay="false" max-width="500px" transition="dialog-transition">
    <v-card>
      <v-card-title primary-title>
        นโยบายความเป็นส่วนตัว<v-spacer></v-spacer>
        <v-btn icon @click="dialog2=false">
          <v-icon>mdi-close</v-icon>
        </v-btn>
      </v-card-title>
      <v-card-text>
        <div class="p-2">
          <p>
            ประกาศเกี่ยวกับความเป็นส่วนตัว
            บริษัท จัดหางาน จ๊อบส์ ดีบี (ประเทศไทย) จำกัด (“ประเทศไทย” หรือ “เรา”) เคารพความเป็นส่วนตัวของข้อมูลส่วนบุคคลของผู้ใช้ และจะดูแลให้เจ้าหน้าที่ของเราปฏิบัติตามมาตรฐานการรักษาความปลอดภัยและการรักษาความลับที่เคร่งครัดที่สุดในเรื่องเกี่ยวกับข้อมูลส่วนบุคคลทั้งปวงที่ท่านในฐานะของผู้ใช้ ไม่ว่าจะเป็นผู้ใช้ที่ไม่ลงทะเบียนหรือผู้ใช้ที่ลงทะเบียนก็ตาม (เรียกรวมกันว่า “ผู้ใช้” หรือ “ท่าน”) ได้มอบให้แก่ประเทศไทย ผ่านทางเว็บไซต์ของเรา

            ประเทศไทย ขอแจ้งให้ท่านทราบว่า ประกาศเกี่ยวกับความเป็นส่วนตัวฉบับนี้ (“ประกาศเกี่ยวกับความเป็นส่วนตัว”) มีความสำคัญอย่างยิ่งต่อผู้ใช้ และดังนั้นเราขอแนะนำเป็นอย่างยิ่งให้ท่านอ่านประกาศเกี่ยวกับความเป็นส่วนตัวฉบับนี้อย่างละเอียดครบถ้วน เพื่อที่ท่านจะเข้าใจนโยบายและแนวปฏิบัติของประเทศไทย เกี่ยวกับการเก็บรวบรวม ใช้ เปิดเผย และประมวลผลข้อมูลส่วนบุคคล (เรียกรวมกันว่า “ประมวลผล”) ซึ่งผู้ใช้ได้มอบให้ในเว็บไซต์ รวมทั้งสิทธิในข้อมูลส่วนบุคคลของท่าน ประกาศเกี่ยวกับความเป็นส่วนตัวฉบับนี้ใช้บังคับกับทั้งผู้ใช้ที่ลงทะเบียนและผู้ใช้ที่ไม่ลงทะเบียน

            โดยการลงทะเบียนหรือใช้บริการ/เว็บไซต์ หรือคลิกปุ่ม “ลงทะเบียน” ผู้ใช้รับรองและยืนยันว่าผู้ใช้ได้รับทราบเกี่ยวกับประกาศเกี่ยวกับความเป็นส่วนตัวฉบับนี้แล้ว และผู้ใช้ยอมรับและตกลงตามข้อกำหนดของประกาศเกี่ยวกับความเป็นส่วนตัวดังกล่าว
          </p>
        </div>
      </v-card-text>
    </v-card>
  </v-dialog>
  <v-dialog v-model="dialog5" scrollable :overlay="false" max-width="500px" transition="dialog-transition">
    <v-card>
      <v-card-title primary-title>
        ติดต่อเรา<v-spacer></v-spacer>
        <v-btn icon @click="dialog5=false">
          <v-icon>mdi-close</v-icon>
        </v-btn>
      </v-card-title>
      <v-card-text>

        <Core-list head="ศูนย์จังหวัดพะเยา" txt="0988203975" icon="mdi-phone"></Core-list>
        <Core-list head="ศูนย์จังหวัดเชียงใหม่" txt="0988203975" icon="mdi-phone"> </Core-list>
      </v-card-text>
    </v-card>
  </v-dialog>
</div>
</template>

<script>
export default {
  name: "Info.vue",
  data() {
    return {
      dialog: false,
      dialog2: false,
      dialog5: false,
    };
  },
  methods:{
    async logout(){
      await this.$auth.logout()
      await this.$router.push('/')
    }
  }
}
</script>

<style scoped>

</style>